micropython/micropython/ports/esp32/machine_encoder.c
    // What to do when control input is low or high?
    if (self->bPinNumber == COUNTER_UP) {
        r_enc_config.lctrl_mode = PCNT_MODE_KEEP; // Keep the primary counter mode if low
        r_enc_config.hctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if high
    } else {
        r_enc_config.lctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if low
        r_enc_config.hctrl_mode = PCNT_MODE_KEEP; // Keep the primary counter mode if high
    }

    // Set the maximum and minimum limit values to watch
    r_enc_config.counter_h_lim = INT16_ROLL;
    r_enc_config.counter_l_lim = -INT16_ROLL;

    check_esp_err(pcnt_unit_config(&r_enc_config));
    check_esp_err(pcnt_counter_pause(self->unit));

    // Enable events on maximum and minimum limit values
    check_esp_err(pcnt_event_enable(self->unit, PCNT_EVT_H_LIM));
    check_esp_err(pcnt_event_enable(self->unit, PCNT_EVT_L_LIM));

    if (args[ARG_filter].u_int != -1) {
        self->filter = ns_to_filter(args[ARG_filter].u_int);
    }
    // Filter out bounces and noise
    set_filter_value(self->unit, self->filter);

    if (args[ARG_scale].u_obj != MP_OBJ_NULL) {
        if (mp_obj_is_type(args[ARG_scale].u_obj, &mp_type_float)) {
            self->scale = mp_obj_get_float_to_f(args[ARG_scale].u_obj);
        } else if (mp_obj_is_type(args[ARG_scale].u_obj, &mp_type_int)) {
            self->scale = mp_obj_get_int(args[ARG_scale].u_obj);
        } else {
            mp_raise_TypeError(MP_ERROR_TEXT("scale argument muts be a number"));
        }
    }

    if (args[ARG_match1].u_obj != MP_OBJ_NULL) {
        self->match1 = GET_INT(args[ARG_match1].u_obj);
        self->counter_match1 = self->match1 % INT16_ROLL;
        check_esp_err(pcnt_set_event_value(self->unit, EVT_THRES_1, (int16_t)self->counter_match1));
        self->counter_match1 = self->match1 - self->counter_match1;
    }
    if (args[ARG_match2].u_obj != MP_OBJ_NULL) {
        self->match2 = GET_INT(args[ARG_match2].u_obj);
        self->counter_match2 = self->match2 % INT16_ROLL;
        check_esp_err(pcnt_set_event_value(self->unit, EVT_THRES_0, (int16_t)self->counter_match2));
        self->counter_match2 = self->match2 - self->counter_match2;
    }

    pcnts[self->unit] = self;

    // Enable interrupts for PCNT unit
    register_isr_handler();
    check_esp_err(pcnt_intr_enable(self->unit));
    check_esp_err(pcnt_counter_resume(self->unit));
}

STATIC void pcnt_init_new(mp_pcnt_obj_t *self, size_t n_args, const mp_obj_t *args) {
    self->aPinNumber = PCNT_PIN_NOT_USED;
    self->bPinNumber = PCNT_PIN_NOT_USED;

    self->scale = 1.0;
    self->filter = 0;

    self->counter = 0;

    self->status = 0;
    self->match1 = 0;
    self->match2 = 0;
    self->counter_match1 = 0;
    self->counter_match2 = 0;
    self->handler_match1 = MP_OBJ_NULL;
    self->handler_match2 = MP_OBJ_NULL;
    self->handler_zero = MP_OBJ_NULL;

    self->unit = mp_obj_get_int(args[0]);
    if ((self->unit < 0) || (self->unit >= PCNT_UNIT_MAX)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("id must be from 0 to %d"), PCNT_UNIT_MAX - 1);
    }
    if (pcnts[self->unit] != MP_OBJ_NULL) {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("already used"));
    }

    if (n_args >= 2) {
        self->aPinNumber = pin_or_int(args[1]);
    }
}

STATIC mp_obj_t machine_Counter_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, 5, true);

    // create Counter object for the given unit
    mp_pcnt_obj_t *self = m_new_obj(mp_pcnt_obj_t);
    self->base.type = &machine_Counter_type;

    pcnt_init_new(self, n_args, args);

    self->bPinNumber = COUNTER_UP;
    self->edge = RISING;

    // Process the remaining parameters
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_Counter_init_helper(self, n_args - 1, args + 1, &kw_args);

    check_esp_err(pcnt_counter_clear(self->unit));
    self->counter = 0;

    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_Counter_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    mp_machine_Counter_init_helper(args[0], n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(machine_Counter_init_obj, 1, machine_Counter_init);

STATIC void common_print_kw(const mp_print_t *print, mp_pcnt_obj_t *self) {
    if (self->handler_match1 != MP_OBJ_NULL) {
        mp_printf(print, ", match1=%ld", self->match1);
    }
    if (self->handler_match2 != MP_OBJ_NULL) {
        mp_printf(print, ", match2=%ld", self->match2);
    }
    mp_printf(print, ", filter_ns=%u, scale=%f)", get_filter_value_ns(self->unit), self->scale);
}

STATIC void machine_Counter_print(const mp_print_t *print, mp_obj_t self_obj, mp_print_kind_t kind) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

    mp_printf(print, "Counter(%u, src=Pin(%u), direction=", self->unit, self->aPinNumber);
    if (self->bPinNumber >= 0) {
        mp_printf(print, "Pin(%u)", self->bPinNumber);
    } else {
        mp_printf(print, "%s", self->bPinNumber == COUNTER_UP ? "Counter.UP" : "Counter.DOWN");
    }
    mp_printf(print, ", edge=%s", self->edge == RISING ? "Counter.RISING" : self->edge == FALLING ? "Counter.FALLING" : "Counter.RISING | Counter.FALLING");
    common_print_kw(print, self);
}

// Register class methods
#define COMMON_METHODS \
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_PCNT_deinit_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_value), MP_ROM_PTR(&machine_PCNT_count_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_get_value), MP_ROM_PTR(&machine_PCNT_get_count_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_scaled), MP_ROM_PTR(&machine_PCNT_scaled_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_filter_ns), MP_ROM_PTR(&machine_PCNT_filter_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_pause), MP_ROM_PTR(&machine_PCNT_pause_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_resume), MP_ROM_PTR(&machine_PCNT_resume_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_id), MP_ROM_PTR(&machine_PCNT_id_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_status), MP_ROM_PTR(&machine_PCNT_status_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_irq), MP_ROM_PTR(&machine_PCNT_irq_obj) }

